/*
 * @Author: Dad
 * @Date: 2020-07-28 11:47:33
 * @LastEditors: Dad
 * @LastEditTime: 2020-07-28 11:50:44
 */

import React from 'react';
import { Typography } from 'antd';

const { Title, Paragraph, Text } = Typography;

/** 协议文档 */
const text = () => {
  return (
    <Typography style={{ height: '100%' }}>
      <Paragraph>欢迎访问星权益商户服务平台（www.yunjinshuke.com）</Paragraph>
      <Paragraph>
        在注册、使用星权益商户服务平台（下文简称“星权益平台”）前，
        <Text strong>
          请您务必仔细阅读本使用协议，尤其是本使用协议中以粗体着重提示的条款、法律责任与免责条款。一旦您在“我已阅读并同意《星权益商户服务平台使用协议》”前打“✔”或开始以其他方式使用星权益平台，即表明您已充分阅读并完全理解本使用协议项下的全部条款，同意将其作为确定您与湖南云金数科信息技术有限公司（下文简称“云金数科公司或我们”）间权利义务的依据。
        </Text>
        如您不同意本使用协议或其中任何条款约定，您应该停止注册程序，并不得以任何形式访问我们的服务。
      </Paragraph>
      <Paragraph>
        本使用协议内容包含现在及将来云金数科公司通过网络或通讯方式告知您的各项操作提示、规则、公告、说明等（以下统称“服务规则”），所有服务规则均为本使用协议不可分割的一部分，与本使用协议具有同等法律效力。
      </Paragraph>
      <Paragraph strong>
        云金数科公司将根据业务需求及监管要求不时修改本使用协议，请您注意查看。
      </Paragraph>
      <Title level={4}>一、权利声明</Title>
      <Paragraph>
        1.1
        星权益平台由云金数科公司开发及运营。星权益平台LOGO、“星权益”等文字及图形组合为云金数科公司的注册商标。未经云金数科公司书面授权，您不得擅自使用。
        1.2
        星权益平台所有的产品、服务、技术与所有程序的知识产权均归属于云金数科公司或归其权利人所有。除云金数科公司另有声明外，星权益平台相关的全部信息内容（包括但不限于：文字、图形、图片、照片、音频、视频、图标、色彩、版面设计、电子文档）的所有权利（包括但不限于版权、商标权、专利权、商业秘密和其他所有相关权利）均为云金数科公司所有，受相关法律法规保护。
        1.3
        本使用协议未明示授权的其他一切权利仍归云金数科公司所有，您使用其他权利时须取得云金数科公司的书面授权。
      </Paragraph>
      <Title level={4}>二、服务内容及服务费</Title>
      <Paragraph>
        2.1
        星权益平台为您提供的服务，包括但不限于：权益商城服务、资金管理服务、运营管理服务、及其他增值服务等，实际服务类型及内容以星权益平台的页面展示为准。同时，我们保留终止提供一项或多项服务的权利。
        2.2
        如您使用或购买星权益平台上某一项或多项服务，您需要与云金数科公司确认具体服务对应的服务费及服务条款。
      </Paragraph>
      <Title level={4}>三、使用规则</Title>
      <Paragraph>
        3.1
        您在星权益平台注册时，需要根据星权益平台的页面提示填写信息并提供相关资料，包括但不限于：电子邮箱、身份证、联系方式、公司或团队名称等，并对前述所有资料的真实性、合法性、有效性承担相应法律后果。如您使用星权益平台期间信息资料有所变更，应自变更之日起向我们发出书面通知，以便我们能够及时维护您的账户，并为您提供相应服务。因您怠于履行前述通知义务而造成的不利后果由您自行承担。
        3.3
        由于互联网的高速发展，您理解并同意：我们将不时对星权益平台进行升级、下载更新、改进、增强及进一步开发星权益平台中开发工具包等优化工作。同时，为改善您体验，我们在征得您的同意后，将云金数科公司的其他相关产品绑定在星权益平台上供您下载和安装。
        3.4
        除经我们书面授权外，您不得对星权益平台进行修改、二次创作、反编译或反向工程，或其他提取源代码的尝试以及实施任何涉嫌侵害我们权利的行为。
        3.5您在使用我们提供的服务时，必须遵守法律规定、行业惯例和社会公共道德，不侵犯第三人的权益，不会利用星权益平台提供的服务进行存储、发布、传播如下信息和内容：
        （ⅰ）违反宪法确定的基本原则的；
        （ⅱ）危害国家安全，泄漏国家机密，颠覆国家政权，破坏国家统一的；
        （ⅲ）损害国家荣誉和利益的；
        （ⅳ）煽动民族仇恨、民族歧视，破坏民族团结的；
        （ⅴ）破坏国家宗教政策，宣扬邪教和封建迷信的；
        （ⅵ）散布谣言，扰乱社会秩序，破坏社会稳定的；
        （ⅶ）散布或者从事淫秽、色情、赌博、洗钱、暴力、恐怖或者教唆犯罪的；
        （ⅷ）侮辱或者诽谤他人，侵害他人合法权益的；
        （ix）煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；
        （x）以非法民间组织名义活动的；
        （xi）含有法律、行政法规禁止的其它内容的。 3.6
        我们保留在任何时候根据适用法律、法规、法律程序或政府要求的需要而披露任何信息，或由我们自主决定全部或部分地编辑、删除任何信息或资料的权利。
        3.7
        隐私政策：为了给您提供更好的服务，当您使用或者启动星权益营销系统时，涉及用户的相关信息、兑换记录等信息，除了得到您的授权、或者相关政府部门根据法律法规的规定提出要求、或者您违反本使用协议的约定、或者维护我们合法权利的情况外，我们将不会泄露您的任何信息。
        3.8
        为了给您提供更全面的服务，星权益平台的部分功能使用第三方软件或技术，该等使用我们已取得合法授权。因第三方软件或技术引发的任何纠纷，我们将向您提供该第三方的联系信息，由该第三方负责解决，我们不承担任何责任。您理解并同意，我们不对第三方软件或技术提供客服支持，若您需要获取支持，请与该软件或技术提供商联系。
      </Paragraph>
      <Title level={4}>四、内容所有权</Title>
      <Paragraph>
        您在星权益平台上发布的信息内容由我们双方共同所有，任何其他组织或个人未经我们授权同意，不得复制、转载、擅改其内容。
      </Paragraph>
      <Title level={4}>五、安全条款</Title>
      <Paragraph>
        5.1
        非经我们或我们授权开发并正式发布的其它任何由星权益平台衍生的软件均属非法，下载、安装、使用上述衍生此类软件，将可能导致不可预知的风险，建议您不要轻易下载、安装、使用，由此产生的一切法律责任与纠纷一概与我们无关。
        5.2
        您注册成功后，我们将给予您相应的账号、密码，该账号和密码由您负责保管，请您不要将您的账号、密码转让或出借予他人使用。如您发现有他人冒用或盗用您的账号及密码或任何其他未经合法授权之情形时，应立即以有效方式通知我们，要求我们暂停相关服务。同时，您理解我们对您的请求采取行动需要合理期限，在此之前，我们对已执行的指令及(或)所导致的您的损失不承担任何责任。
        5.3 您承诺：尽最大注意保护好您的APP KEY、App
        Secret等信息。如若泄露，您需要第一时间联系我们更改。由于您主观或者客观原因泄露上述信息，所导致的风险及损失由您自行承担。
        5.4
        星权益平台同大多数互联网软件一样，可能受到各种安全问题的侵扰，继而影响星权益平台的正常使用。您应高度重视信息安全及资料保护，以免遭致损失和骚扰。
      </Paragraph>
      <Title level={4}>六、消费条款</Title>
      <Paragraph>
        6.1
        您在星权益平台所开立的账户为虚拟电子账户，不可转账或用于其它业务。我们通过该账户接收来自您的操作指令后，向您用户的账户或订单指定的账户完成支付。您对您账户发出的操作指令的真实性、合法性予以负责。星权益平台不提供任何形式的冲正功能，但由于星权益平台的原因造成的支付相关的问题，由星权益平台负责协调处理。实际交易结算以星权益平台及第三方支付系统记录的充值、支付记录为准。
        6.2
        为保证交易安全、结算方便，星权益平台采取交易预付款、实时结算的模式。在使用星权益平台增值服务前，您应向云金数科公司指定账户支付交易预付款，云金数科公司根据您通过星权益平台发出的操作指令，从预付款中实时扣减相应的金额。就前述账目信息，云金数科公司将通过星权益平台或书面结算单的形式与您核对。如您对账目信息有异议的，应及时提出，经共同确认确有差错的，采取多退少补的处理方式。
        6.3
        为确保您能正常使用星权益平台上的各项服务，您应根据实际需求及时支付交易预付款至云金数科公司，因预付款金额不足而导致有关服务无法使用所产生的不利后果由您自行承担。
        6.4
        各类兑换项、活动的资费标准，请以星权益平台展示的价目表说明为准。我们保留根据市场变化调整规则、价格、资费的权利，您可以自主选择是否使用。我们将在通过星权益平台告知您前述信息的变更，请留意查看。
      </Paragraph>
      <Title level={4}>七、法律责任与免责</Title>
      <Paragraph>
        7.1
        如您违反本使用协议或服务规则，导致云金数科公司及其关联方、其他第三方受有损失的，您应承担赔偿责任，赔偿范围包括但不限于：直接损失、因主张权利而支出的诉讼费用及律师费等。同时，我们有权视您的行为性质，采取包括但不限于：中断使用许可、停止提供服务、限制使用、法律追究等措施。
        7.2
        星权益平台采用互联网信息技术方式为您提供服务，因此会受到各个环节不稳定因素的影响，可能存在因不可抗力、计算机病毒、黑客攻击、系统不稳定、您所在位置、关机以及其他任何网络、技术、通信线路等原因造成的服务中断或不能满足要求的风险。您理解前述风险的存在，并同意承担前述风险下的不利后果，免除我们的全部责任。
        7.3
        因第三方如电信部门的通讯线路故障、技术问题、网络、电脑故障、系统不稳定性及其他各种不可抗力，而导致您受有损失，我们不承担任何责任。
        7.4
        如出现上述影响您使用星权益平台的情形，我们承诺在第一时间内与相关单位配合，及时处理进行修复。您理解，我们采取措施需要一定时限。在此之前，我们对上述情形所导致的您的损失不承担任何责任。
      </Paragraph>
      <Title level={4}>八、其他条款</Title>
      <Paragraph>
        8.1 本使用协议的任何条款的部分或全部无效的者，不影响其它条款的效力。 8.2
        本使用协议的解释、效力及纠纷的解决，适用于中华人民共和国法律。若您和我们之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，您同意将纠纷或争议提交湖南云金数科信息技术有限公司住所地的人民法院诉讼解决。
      </Paragraph>
      <Paragraph style={{ float: 'right' }}>
        湖南云金数科信息技术有限公司
      </Paragraph>
    </Typography>
  );
};

export default text;
